# put it in apps god damnit
cask_args appdir: "/Applications"

# core
brew "binutils"
brew "coreutils"
brew "diffutils"
brew "findutils"
brew "moreutils"
# prefixed
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "gnu-which"
# file search/display/manipulation/etc
brew "ack"
brew "bat"
brew "fzf"
brew "grep"
brew "jq"
brew "less"
brew "ripgrep"
brew "stow"
brew "tree"
brew "zoxide"
# processing
brew "gawk"
brew "rename"
brew "ffmpeg"
# compression
brew "gzip"
brew "unzip"
brew "asimov" # time-machine enhancement
# inline editing
brew "readline"
# networking/system
brew "gnupg"
brew "htop"
brew "nmap"
brew "openssh"
brew "openssl"
brew "rsync"
brew "telnet"
brew "wget"
# terminal
brew "direnv"
brew "neovim"
brew "starship"
brew "tmux"
brew "zplug"
brew "timescam/homebrew-tap/pay-respects"
# tools
brew "git"
brew "git-lfs"
brew "graphviz"
brew "dotenvx"
brew "protobuf"
# js
brew "node"
brew "n" # node version manager
brew "pnpm"
brew "yarn"
brew "pnpm"
# ios/macos
brew "mas" # mac app store search
brew "aria2"
brew "applesimutils"
brew "watchman"
brew "xcodes"
brew "cocoapods"
tap "facebook/fb"
brew "idb-companion"
brew "libimobiledevice"
tap "mobile-dev-inc/tap"
brew "maestro"
# python
brew "python"
brew "pyenv"
# db/cache
brew "postgresql"
brew "sqlite"
brew "redis"

#########
# casks #
#########

# tools
cask "claude"
cask "spotify"
cask "1password"
cask "1password-cli"
cask "cleanshot"
cask "raycast"
cask "rectangle"
cask "protonvpn"
cask "tailscale-app"
cask "the-unarchiver"
cask "transmission"
# dev
cask "cmux"
cask "cursor"
cask "expo-orbit"
cask "linear-linear"
cask "xcodes-app"
cask "claude-code"
cask "android-platform-tools"
cask "android-studio"
cask "zulu@17"
# browsers
cask "arc"
cask "firefox"
cask "google-chrome"
# design/etc
cask "figma"
cask "font-hack"
cask "font-hack-nerd-font"
cask "sf-symbols"
# chat
cask "discord"
cask "signal"
cask "slack"
cask "zoom" # bleh

# stfu apple music holy shit
cask "notunes"
