# tap
tap "homebrew/cask-fonts"
tap "homebrew/bundle"
tap "wix/brew"
tap "mobile-dev-inc/tap"
tap "supabase/tap"
tap "facebook/fb"

# put it in apps god damnit
cask_args appdir: "/Applications"

##
# gnutils
##

# core
brew "binutils"
brew "coreutils"
brew "diffutils"
brew "findutils"
brew "moreutils"
# prefixed
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "gnu-which"
# file search/display/manipulation/etc
brew "ack"
brew "ccat"
brew "fzf"
brew "grep"
brew "jq"
brew "less"
brew "ripgrep"
brew "stow"
brew "tree"
brew "zoxide"
# processing
brew "gawk"
brew "rename"
brew "ffmpeg"
# compression
brew "gzip"
brew "unzip"
brew "asimov" # time-machine enhancement
# inline editing
brew "readline"
# networking/system
brew "gnupg"
brew "htop"
brew "nmap"
brew "openssh"
brew "openssl"
brew "rsync"
brew "telnet"
brew "wget"

brew "mas" # mac app store search

##
# terminal
##
brew "direnv"
brew "neovim"
brew "starship"
brew "tmux"
brew "zsh"

##
# dev
##

brew "git"
brew "git-lfs"
# js
brew "node"
brew "n" # node version manager
brew "pnpm"
# ios/mobile
brew "aria2" # dependency for xcodes
brew "watchman"
brew "xcpretty"
brew "xctool"
brew "xcodes"
brew "cocoapods"
brew "fastlane"
brew "idb-companion"
brew "libimobiledevice"
brew "maestro"
# python
brew "python"
brew "pyenv"
# rust
brew "rust"
# db/cache
brew "postgresql"
brew "sqlite"
brew "redis"
# misc tools"
brew "graphviz"
# services
brew "awscli"

##
# cask
##

# tools
cask "1password"
cask "1password-cli"
cask "cleanshot"
cask "jordanbaird-ice"
cask "raycast"
cask "rectangle"
cask "the-unarchiver"
cask "transmission"

# apps
cask "discord"
cask "ledger-live"
cask "notunes"
cask "slack"
cask "spotify"
cask "whatsapp"

# browsers
cask "arc"
cask "google-chrome"

# terminal/ide
cask "cursor"
cask "font-hack"
cask "font-hack-nerd-font"
cask "wezterm"

# dev
cask "xcodes"
cask "android-commandlinetools"
cask "android-studio" # ugh
cask "clickhouse"
cask "expo-orbit"
cask "yaak"
# android shit
cask "zulu@17"
brew "gradle"
