###
# Tap
###
tap "homebrew/cask-fonts"
tap "homebrew/bundle"
tap "wix/brew"
tap "mobile-dev-inc/tap"
tap "supabase/tap"
tap "facebook/fb"

cask_args appdir: "/Applications"

###
# Brew
###

# gnutils
brew "ack"
brew "binutils"
brew "ccat"
brew "coreutils"
brew "diff-so-fancy"
brew "diffutils"
brew "findutils"
brew "fzf"
brew "gawk"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "gnu-which"
brew "gnupg"
brew "grep"
brew "gzip"
brew "htop"
brew "less"
brew "moreutils"
brew "ncurses"
brew "nmap"
brew "openssh"
brew "openssl"
brew "readline"
brew "rename"
brew "rsync"
brew "screen"
brew "telnet"
brew "tree"
brew "wget"
brew "unzip"
brew "vim"

# terminal
brew "zsh"
brew "direnv"
brew "stow"
brew "tmux"
brew "ripgrep"

# dev
brew "git"
brew "git-lfs"
brew "node"
brew "awscli"
brew "python"
brew "pyenv"
brew "aria2"
brew "graphviz"
brew "grpc"
brew "redis"
brew "postgresql"
brew "sqlite"
brew "supabase"
brew "yarn"
brew "chruby"
brew "ruby-install"

# mobile
brew "applesimutils"
brew "watchman"
brew "xcpretty"
brew "xctool"
brew "swiftlint"
brew "swift-format"
brew "cocoapods"
brew "fastlane"
brew "idb-companion"
brew "libimobiledevice"
brew "maestro"

# tools
brew "ffmpeg"
brew "jq"
brew "mas"
brew "zlib"
brew "asimov"

###
# Cask
##
cask "1password"
cask "alacritty"
cask "android-studio"
cask "anytype"
cask "arc"
cask "cleanshot"
cask "cursor"
cask "expo-orbit"
cask "font-hack"
cask "font-hack-nerd-font"
cask "jordanbaird-ice"
cask "linear"
cask "mos"
cask "raycast"
cask "rectangle"
cask "slack"
cask "spotify"
cask "the-unarchiver"
cask "todoist"
cask "transmission"
cask "visual-studio-code"
# cask "xcodes" ## this runs in the install script
cask "yaak"

# android
cask "zulu@17"
brew "gradle"
