aaron-bond.better-comments
astro-build.astro-vscode
atommaterial.a-file-icon-vscode
bierner.markdown-mermaid
bracketpaircolordlw.bracket-pair-color-dlw
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
eamodio.gitlens
editorconfig.editorconfig
fill-labs.dependi
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
github.copilot
github.copilot-chat
github.vscode-pull-request-github
gruntfuggly.todo-tree
jeff-hykin.better-cpp-syntax
mechatroner.rainbow-csv
miguelsolorio.fluent-icons
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.wordcount
ms-vsliveshare.vsliveshare
naumovs.color-highlight
pkief.material-icon-theme
pmneo.tsimporter
redhat.vscode-xml
redhat.vscode-yaml
rido3.wordcount
ritwickdey.liveserver
rust-lang.rust-analyzer
steoates.autoimport
streetsidesoftware.code-spell-checker
tabbyml.vscode-tabby
tal7aouy.icons
tamasfe.even-better-toml
teabyii.ayu
tonybaloney.vscode-pets
twxs.cmake
vadimcn.vscode-lldb
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vscode-icons-team.vscode-icons
waderyan.gitblame
wakatime.vscode-wakatime
wayou.vscode-todo-highlight
xabikos.javascriptsnippets
yzane.markdown-pdf
yzhang.markdown-all-in-one
